Documents/why-this-project.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Why have I chosen this project?</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="title">Why have I chosen this project?</span><div class="links"><a href="/">Home</a><a href="/home/runner/work/EPQ/EPQ/Notes/daily/ltximg">Latest daily note</a></div></div>
</div>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org33aa393">What is the project idea?</a>
<ul>
<li><a href="#org1dbe398">Ok but what does that actually mean?</a></li>
</ul>
</li>
<li><a href="#org59bfc2d">Why have I chosen this project?</a></li>
<li><a href="#org88e909c">What are the benefits and drawbacks of this project?</a>
<ul>
<li><a href="#org0e888fb">Benefits</a></li>
<li><a href="#org53e52e8">Drawbacks</a></li>
<li><a href="#orgffa8ded">What could I have done instead?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org33aa393" class="outline-2">
<h2 id="org33aa393">What is the project idea?</h2>
<div class="outline-text-2" id="text-org33aa393">
<p>
The project is a process management daemon to run on my Linux server, it will help to manage projects, auto-restarting them if they exit as well as providing an API (and possibly web interface) to manage variables, code through git, and the status of the project itself.
</p>
</div>

<div id="outline-container-org1dbe398" class="outline-3">
<h3 id="org1dbe398">Ok but what does that actually mean?</h3>
<div class="outline-text-3" id="text-org1dbe398">
<p>
My artifact will be able to
</p>
<ul class="org-ul">
<li>Run a process</li>
<li>Restart it if it fails</li>
<li>Control the environment varibles the project runs with</li>
<li>Give an API that lets us
<ul class="org-ul">
<li>Start, stop &amp; restart the project</li>
<li>Give information about the project (memory usage, is it started, logs etc.)</li>
</ul></li>
<li>Pull code from git, either when updated or on command</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org59bfc2d" class="outline-2">
<h2 id="org59bfc2d">Why have I chosen this project?</h2>
<div class="outline-text-2" id="text-org59bfc2d">
<ul class="org-ul">
<li>I've had this project idea for a while (since mid-year-11)</li>
<li>I need to run something like this on my server (see 'what could I have done instead' section)</li>
<li>It's something I'm interested in, don't know how to do yet, but am confident I will be able to do within the EPQ time</li>
</ul>
</div>
</div>
<div id="outline-container-org88e909c" class="outline-2">
<h2 id="org88e909c">What are the benefits and drawbacks of this project?</h2>
<div class="outline-text-2" id="text-org88e909c">
</div>
<div id="outline-container-org0e888fb" class="outline-3">
<h3 id="org0e888fb">Benefits</h3>
<div class="outline-text-3" id="text-org0e888fb">
<ul class="org-ul">
<li>It's an interesting project</li>
<li>I need something like this, the EPQ is a perfect excuse to set aside time to complete it better than I would otherwise</li>
</ul>
</div>
</div>
<div id="outline-container-org53e52e8" class="outline-3">
<h3 id="org53e52e8">Drawbacks</h3>
<div class="outline-text-3" id="text-org53e52e8">
<ul class="org-ul">
<li>May be more difficult to show personal growth, as I do computer programming already, although never quite like this</li>
<li>Other solutions may already exist</li>
</ul>
</div>
</div>

<div id="outline-container-orgffa8ded" class="outline-3">
<h3 id="orgffa8ded">What could I have done instead?</h3>
<div class="outline-text-3" id="text-orgffa8ded">
<ul class="org-ul">
<li>Used 'docker swarm' or 'docker compose'</li>
<li>Continued to use PM2 (which is what we're currently using)</li>
<li>Used the proxmox API (we're currently using proxmox, although not using the API to manage containers)</li>
</ul>

<p>
All of these have disadvantages though
</p>
<ul class="org-ul">
<li>None of these can pull from git</li>
<li>Docker does not expose an API for container management</li>
<li><p>
PM2 does not expose an API for process management, and does not contain processes
</p>

<p>
And plus, it's always nice to know how your own systems work&#x2026;
</p></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
